{"modelTopology":{"class_name":"Sequential","config":{"name":"sequential_1","layers":[{"class_name":"Dense","config":{"units":1024,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1","trainable":true,"batch_input_shape":[null,16],"dtype":"float32"}},{"class_name":"Dense","config":{"units":1024,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2","trainable":true}},{"class_name":"Dense","config":{"units":1024,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3","trainable":true}},{"class_name":"Dense","config":{"units":1024,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense4","trainable":true}},{"class_name":"Dense","config":{"units":4,"activation":"softmax","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense5","trainable":true}}]},"keras_version":"tfjs-layers 3.13.0","backend":"tensor_flow.js"},"format":"layers-model","generatedBy":"Bell.T Science","convertedBy":null,"weightsManifest":[{"paths":["./weights.bin"],"weights":[{"name":"dense_Dense1/kernel","shape":[16,1024],"dtype":"float32"},{"name":"dense_Dense1/bias","shape":[1024],"dtype":"float32"},{"name":"dense_Dense2/kernel","shape":[1024,1024],"dtype":"float32"},{"name":"dense_Dense2/bias","shape":[1024],"dtype":"float32"},{"name":"dense_Dense3/kernel","shape":[1024,1024],"dtype":"float32"},{"name":"dense_Dense3/bias","shape":[1024],"dtype":"float32"},{"name":"dense_Dense4/kernel","shape":[1024,1024],"dtype":"float32"},{"name":"dense_Dense4/bias","shape":[1024],"dtype":"float32"},{"name":"dense_Dense5/kernel","shape":[1024,4],"dtype":"float32"},{"name":"dense_Dense5/bias","shape":[4],"dtype":"float32"}]}]}